logs/backup_benchmark_20250709_172547/h3_100ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 17:28:19
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.06s, 947.65 req/s, 264.00KB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 278.58KB (285267) total, 210.90KB (215959) headers (space savings 26.79%), 60.55KB (62000) data
UDP datagram: 746 sent, 661 received
                     min         max         mean         sd        +/- sd
time for request:      563us    304.15ms     79.14ms    102.93ms    80.50%
time for connect:    55.84ms       1.04s    125.68ms    228.85ms    94.00%
time to 1st byte:    62.53ms       1.04s    177.18ms    231.51ms    94.00%
req/s           :       9.56      150.58       81.45       52.29    56.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.07s, 8418.11 req/s, 2.31MB/s
requests: 9000 total, 9000 started, 9000 done, 9000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 9000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.47MB (2584836) total, 1.85MB (1943436) headers (space savings 26.80%), 544.92KB (558000) data
UDP datagram: 1543 sent, 3188 received
                     min         max         mean         sd        +/- sd
time for request:      989us    727.44ms    362.00ms    220.22ms    56.74%
time for connect:    81.96ms       1.03s    139.95ms    202.85ms    95.00%
time to 1st byte:    85.70ms       1.03s    158.93ms    199.13ms    95.00%
req/s           :      84.53      215.51      115.68       20.69    87.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-09 17:28:26
CSV Log: /logs/benchmark_20250709_172547/h3_100ms_1pct.csv